TG_POST_LINK = 'https://t.me/bio_olimp_alles/1562'
PRICE = 100

MESSAGES_DICT = {
    'start': 'Привет 💚 Ты пришёл за полезным файлом, верно?',
    'start_keyboard': 'Да 👀 Кто ты, загадочный помощник?',
    'answer_start_kayboard': '''
Давай знакомиться 🤝

Меня создали преподаватели олимпиадной биологии из Alles: Аня, Тимофей и Юля. Они очень старались и сделали файл по перечневым олимпиадам.

Если хочешь, подпишись на наш канал, там много интересного: @bio\\_olimp\\_alles 😉

Ну а теперь скачивай файл. Удачного бота 🚀
''',
    'get_file': 'Получить файл 📎',
    'selling_message': f'''
Привет 👋

Мои создатели просили передать очень важную информацию ⚠️

Аня, Тимофей и Юля запускают интенсив по подготовке к перечневым олимпиадам по биологии 🌿

Вас ждут:
1. Лекции по важнейшим темам олимпиады
2. Семинары с прорешкой важнейших задач и заданий олимпиад прошлых лет 
3. Домашние задания с разбором
4. Регулярные индивидуальные созвоны с преподавателем перед олимпиадой для уменьшения стресса и разбора самых сложных тем или задач

[▶️ Анонс ◀️]({TG_POST_LINK})

''',
    'morning': f'''
Доброе утро ☀️

Мои создатели просили передать очень важную информацию ⚠️

Аня, Тимофей и Юля запускают интенсив по подготовке к перечневым олимпиадам по биологии 🌿

Вас ждут:
1. Лекции по важнейшим темам олимпиады
2. Семинары с прорешкой важнейших задач и заданий олимпиад прошлых лет 
3. Домашние задания с разбором
4. Регулярные индивидуальные созвоны с преподавателем перед олимпиадой для уменьшения стресса и разбора самых сложных тем или задач

[▶️ Анонс ◀️]({TG_POST_LINK})
''',
    'buy': 'Ну как тебе? Скорее жми на кнопку, чтобы записаться!',
    'buy_button': 'Записаться в один клик 🚀',
    'ask_for_email': 'Пожалуйста, напиши свой email, чтобы мы смогли добавить тебя на нашу платформу 📧',
    'after_payment': 'Оплата прошла 🥳. Мы с тобой свяжемся и везде добавим',
    'error': 'Произошла ошибка 😔 Попробуй перезапустить меня командой /start'
}

PATHS_DICT = {
    'team_photo': 'alles_team.png',
    'pdf_file': 'alles_soures.pdf',
}